# Series 객체와 숫자 연산 수행

- Series 객체의 모든 원소에 숫자 연산 적용 => 브로드캐스팅broadcasting

In [3]:
import pandas as pd

# Series 객체 생성
sr=pd.Series([10,20,30,40])

# Series 객체 데이터 확인
sr

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
# Series 객체 + 숫자
result=sr+5
print(f'result=>{result}', f'result type=>{type(result)}', sep='\n')

result=>0    15
1    25
2    35
3    45
dtype: int64
result type=><class 'pandas.core.series.Series'>

In [15]:
# Series 객체 + Series 객체 연산 수행
sr1=pd.Series({'국어':90, '영어':100, '수학':88})
sr2=pd.Series({'수학':70, '국어':90, '영어':50})
sr3=pd.Series({'국어':90, '영어':50})

In [16]:
# 인덱스 정렬 후 동일 인덱스끼리 연산 수행
result=sr1+sr2
result

국어    180
수학    158
영어    150
dtype: int64

In [17]:
# 동일 인덱스가 없는 경우 연산 수행 안함 => NaN 빈칸 의미
result=sr1+sr3
result

국어    180.0
수학      NaN
영어    150.0
dtype: float64

## boolean
- Series // DataFrameDF

In [23]:
df=pd.DataFrame({'name':['Park','Kim','Lee'], 'age':[10,21,16],'gender':['F','F','M']})
df

   name  age gender
0  Park   10      F
1   Kim   21      F
2   Lee   16      M

In [22]:
# 성별이 남자인 데이터만 추출하기
df=pd.DataFrame({'name':['Park','Kim','Lee'], 'age':[10,21,16],'gender':['F','F','M']})
df

   name  age gender
0  Park   10      F
1   Kim   21      F
2   Lee   16      M

In [27]:
df.gender=='M'

0    False
1    False
2     True
Name: gender, dtype: bool

In [28]:
df[df.gender=='M']

  name  age gender
2  Lee   16      M

In [35]:
df[(df.gender=='M')*(df.age>=15)]

  name  age gender
2  Lee   16      M

In [36]:
# true 1 False 0       트루곱하기 트루는1 , 트루곱하기 포ㅓㄹ쓰와 폴쓰곱하기뽈쓰=0

In [37]:
df[df.age>15]

  name  age gender
1  Kim   21      F
2  Lee   16      M

In [39]:
df[(df.gender=='M') & (df.age>=15)]

  name  age gender
2  Lee   16      M

산술연산자 + - * /
비교연산자 > < = <= >= !=